### Terraform Plan Results

**Status:** ✅ Success

<details><summary>Show Plan</summary>

```terraform
module.modal_app.null_resource.modal_secrets[0]: Refreshing state... [id=5204225899843989258]
null_resource.web_app_cloudflare_build[0]: Refreshing state... [id=1721545316411390198]
module.modal_app.null_resource.modal_volume[0]: Refreshing state... [id=5644798168022997553]
data.external.modal_source_hash: Reading...
local_file.web_app_wrangler_production[0]: Refreshing state... [id=385ba23f828f0652d32cb2612b6fec0c46009699]
null_resource.control_plane_build: Refreshing state... [id=8095130309819395434]
cloudflare_d1_database.main: Refreshing state... [id=f55dda63-da5a-4103-a56d-ed1c088d4bdc]
module.session_index_kv.cloudflare_workers_kv_namespace.this: Refreshing state... [id=af130657ae9e45b59a91c40cb362fb3d]
data.external.modal_source_hash: Read complete after 0s [id=-]
module.modal_app.null_resource.modal_deploy: Refreshing state... [id=7186748007738638902]
null_resource.d1_migrations: Refreshing state... [id=6509626733240953558]
module.control_plane_worker.cloudflare_worker.this: Refreshing state... [id=bf88879cbd93491ebae373f07687249e]
module.control_plane_worker.cloudflare_worker_version.this: Refreshing state... [id=bbc92e9d-41e2-47b1-8751-8f5adafae468]
module.control_plane_worker.cloudflare_workers_deployment.this: Refreshing state... [id=72541eb8-66d9-4b37-a733-db20f500563a]
null_resource.web_app_cloudflare_deploy[0]: Refreshing state... [id=4729979538467905277]
null_resource.web_app_cloudflare_secrets[0]: Refreshing state... [id=6050167598202515541]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.web_app_wrangler_production[0] will be created
  + resource "local_file" "web_app_wrangler_production" {
      + content              = <<-EOT
            name = "open-inspect-web-colleqtive"
            main = ".open-next/worker.js"
            compatibility_date = "2025-08-15"
            compatibility_flags = ["nodejs_compat", "global_fetch_strictly_public"]
            
            [vars]
            GITHUB_CLIENT_ID = "Iv23livHLxZ9Ei4Ppgtt"
            NEXTAUTH_URL = "https://open-inspect-web-colleqtive.cllqtv.workers.dev"
            CONTROL_PLANE_URL = "https://open-inspect-control-plane-colleqtive.cllqtv.workers.dev"
            NEXT_PUBLIC_WS_URL = "wss://open-inspect-control-plane-colleqtive.cllqtv.workers.dev"
            ALLOWED_USERS = ""
            ALLOWED_EMAIL_DOMAINS = ""
            
            [assets]
            directory = ".open-next/assets"
            binding = "ASSETS"
            
            [[services]]
            binding = "CONTROL_PLANE_WORKER"
            service = "open-inspect-control-plane-colleqtive"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../..//packages/web/wrangler.production.toml"
      + id                   = (known after apply)
    }

  # null_resource.control_plane_build must be replaced
-/+ resource "null_resource" "control_plane_build" {
      ~ id       = "8095130309819395434" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-25T15:07:10Z" -> (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_build[0] must be replaced
-/+ resource "null_resource" "web_app_cloudflare_build" {
      ~ id       = "1721545316411390198" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-25T15:07:10Z" -> (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_deploy[0] must be replaced
-/+ resource "null_resource" "web_app_cloudflare_deploy" {
      ~ id       = "4729979538467905277" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-25T15:07:36Z" -> (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @jmunckhof*